In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.shape

(50, 5)

# Feature Transformation

# Normalization / Min Max Scaler

In [5]:
from sklearn.preprocessing import MinMaxScaler

In [20]:
m = MinMaxScaler()

In [21]:
marketing_spend_fit = m.fit(df[['Marketing Spend']]) #fit means training

In [22]:
marketing_spend_fit

MinMaxScaler()

In [23]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083        8.258720  10.000000    Dhaka  192261.83
1         9.916797        8.809859   9.704467      Ctg  191792.06
2         9.639923        6.897895   9.323318  Rangpur  191050.39
3         9.365682        7.564992   9.061176    Dhaka  182901.99
4         9.297189        6.526640   8.880678  Rangpur  166187.94

In [24]:
df['Marketing Spend'] = m.transform(df[['Marketing Spend']]) # transform means replace

In [25]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        8.258720  10.000000    Dhaka  192261.83
1         0.983359        8.809859   9.704467      Ctg  191792.06
2         0.927985        6.897895   9.323318  Rangpur  191050.39
3         0.873136        7.564992   9.061176    Dhaka  182901.99
4         0.859438        6.526640   8.880678  Rangpur  166187.94

In [26]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        8.258720  10.000000    Dhaka  192261.83
1         0.983359        8.809859   9.704467      Ctg  191792.06
2         0.927985        6.897895   9.323318  Rangpur  191050.39
3         0.873136        7.564992   9.061176    Dhaka  182901.99
4         0.859438        6.526640   8.880678  Rangpur  166187.94

In [16]:
df['Administration'] = m.fit_transform(df[['Administration']]) #fit means training ;  transform means replace

In [27]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        8.258720  10.000000    Dhaka  192261.83
1         0.983359        8.809859   9.704467      Ctg  191792.06
2         0.927985        6.897895   9.323318  Rangpur  191050.39
3         0.873136        7.564992   9.061176    Dhaka  182901.99
4         0.859438        6.526640   8.880678  Rangpur  166187.94

In [28]:
df['Transport']=m.fit_transform(df[['Transport']])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        8.258720   1.000000    Dhaka  192261.83
1         0.983359        8.809859   0.940893      Ctg  191792.06
2         0.927985        6.897895   0.864664  Rangpur  191050.39
3         0.873136        7.564992   0.812235    Dhaka  182901.99
4         0.859438        6.526640   0.776136  Rangpur  166187.94

# Standardization

In [69]:
import pandas as pd
import numpy as np
df=pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [70]:
df.tail()

    Marketing Spend  Administration  Transport     Area    Profit
45          1000.23       124153.04    1903.93    Dhaka  64926.08
46          1315.46       115816.21  297114.46  Rangpur  49490.75
47             0.00       135426.92       0.00      Ctg  42559.73
48           542.05        51743.15       0.00    Dhaka  35673.41
49             0.00       116983.80   45173.06      Ctg  14681.40

In [71]:
df.shape

(50, 5)

In [72]:
df.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [73]:
#create object for StandardScaler
from sklearn.preprocessing import StandardScaler
s=StandardScaler()
marketing_spend_fit = s.fit(df[['Marketing Spend']]) #fit means training
marketing_spend_fit

StandardScaler()

In [74]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [79]:
#traning and replcae
#all columns
# 
df['Marketing Spend'] = s.fit_transform(df[['Marketing Spend']]) #fit means training ;  transform means replace
df['Administration'] = s.fit_transform(df[['Administration']])
df['Transport'] = s.fit_transform(df[['Transport']])

In [80]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Max Absulate Scaler

In [2]:
#find absulate value for perticular column and store in a varibale -> .abs()
import pandas as pd
import numpy as np
df=pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [16]:
x= df['Marketing Spend'].abs()

#find max value for this varibale -> .max()
y= df['Marketing Spend'].max()
MarketingSpend =x/y
MarketingSpend.head()

0    0.692617
1    0.983359
2    0.927985
3    0.873136
4    0.859438
Name: Marketing Spend, dtype: float64

In [17]:
x= df['Administration'].abs()
y=df['Administration'].max()
Administration=x/y
Administration.head()

0    0.749527
1    0.828805
2    0.553781
3    0.649738
4    0.500378
Name: Administration, dtype: float64

In [97]:
from sklearn.preprocessing import MaxAbsScaler
Max=MaxAbsScaler()

In [98]:
df['Marketing Spend'] = Max.fit_transform(df[['Marketing Spend']]) #fit means training ;  transform means replace
df['Administration'] = Max.fit_transform(df[['Administration']])
df['Transport'] = Max.fit_transform(df[['Transport']])

In [99]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.449332        0.198805   1.000000    Dhaka  192261.83
1         0.970189        0.401556   0.891559      Ctg  191792.06
2         0.870987       -0.301810   0.751702  Rangpur  191050.39
3         0.772728       -0.056401   0.655513    Dhaka  182901.99
4         0.748187       -0.438385   0.589283  Rangpur  166187.94

# Robust

In [81]:
import pandas as pd

In [84]:
df=pd.read_csv('agora.csv')

In [85]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [86]:
from sklearn.preprocessing import RobustScaler

In [87]:
r= RobustScaler()

In [88]:
df['Marketing Spend'] = r.fit_transform(df[['Marketing Spend']]) #fit means training ;  transform means replace
df['Administration'] = r.fit_transform(df[['Administration']])
df['Transport'] = r.fit_transform(df[['Transport']])

In [89]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94